
## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/37491)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * local_file.appspec
* Update
  * aws_codestarnotifications_notification_rule.apollo_notifications


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_codestarnotifications_notification_rule.apollo_notifications will be updated in-place
  ~ resource "aws_codestarnotifications_notification_rule" "apollo_notifications" {
      ~ event_type_ids = [
          - "codedeploy-application-deployment-started",
          - "codedeploy-application-deployment-succeeded",
            # (1 unchanged element hidden)
        ]
        id             = "arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/5789bde4cd9a729fb9277fe0c0b22b8363d7b005"
        name           = "UserListSearch-Prod-Apollo"
        tags           = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.appspec will be created
  + resource "local_file" "appspec" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "node"
                                  + ContainerPort = 4000
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:318"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"8a617498-3c7a-45c8-9270-b01fcf7bd61b","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":147,"Program":"tfcmt","SHA1":"b199988edbf2d9c80b24bd66ec0932a709eb9fff","Target":"user-list-search-cdk","Vars":{}} -->